nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2]] # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2]] # 3-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]] # 4
  - [-1, 1, DSConv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, DSConv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [9, 1, Conv, [512, 1, 1]] # 11 调整通道数
  - [[6, 10], 1, FullPAD_Tunnel, [512]] # 12 (明确通道数)
  - [[4, 11], 1, FullPAD_Tunnel, [256]] # 13 (明确通道数)
  - [[8, 12], 1, FullPAD_Tunnel, [1024]] # 14 (明确通道数)
  - [-1, 1, UFEA, [1024]] # 15

  # P4/16 分支
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 12], 1, Concat, [1]] # 16
  - [-1, 2, DSC3k2, [512, True]] # 17
  - [[-1, 9], 1, FullPAD_Tunnel, [512]] # 18
  - [-1, 1, UFEA, [512]] # 19

  # P3/8 分支
  - [18, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 13], 1, Concat, [1]] # 21
  - [-1, 2, DSC3k2, [256, True]] # 22
  - [11, 1, Conv, [256, 1, 1]] # 23 (调整通道数)
  - [[23, 24], 1, FullPAD_Tunnel, [256]] # 24
  - [-1, 1, UFEA, [256]] # 25

  # P4/16 融合分支
  - [-1, 1, Conv, [256, 3, 2]] # 26 (下采样)
  - [[-1, 19], 1, Concat, [1]] # 27
  - [-1, 2, DSC3k2, [512, True]] # 28
  - [[-1, 9], 1, FullPAD_Tunnel, [512]] # 29
#  - [-1, 1, UFEA, [512]] # 30

  # P5/32 融合分支
  - [28, 1, Conv, [512, 3, 2]] # 31 (下采样)
  - [[-1, 14], 1, Concat, [1]] # 32
  - [-1, 2, DSC3k2, [1024, True]] # 33
  - [[-1, 12], 1, FullPAD_Tunnel, [1024]] # 34

  # 检测头
  - [[25, 30, 34], 1, Detect, [nc]] # 36